ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/app_httpd.cpp
// Original Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Extensions:
//  Copyright (C) 2024  Armin Joachimsmeyer
//  armin.joachimsmeyer@gmail.com
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <esp_http_server.h>
#include <esp_timer.h>
#include <esp_camera.h>

#include <esp_task_wdt.h>
#include <Arduino.h>
#include <WiFi.h>

#if ESP_ARDUINO_VERSION >= 0x030000 // ESP_ARDUINO_VERSION_VAL(3, 0, 0), ESP_ARDUINO_VERSION_VAL disturbs the auto formatting :-(
#include "esp_private/periph_ctrl.h"
#endif

#include "index_ov2640.h"
#include "index_ov3660.h"
#include <index_small.h>
#include <index_other.h>
#include "css.h"
#include "favicons.h"
#include "logo.h"
#include "storage.h"

#include "esp32-cam-webserver.h"
#include "MotorAndServoControl.h"

typedef struct {
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#ifdef __cplusplus
extern "C" {
#endif
uint8_t temprature_sens_read();
#ifdef __cplusplus
}
#endif

int64_t sFirstFrameTime = 0;
int64_t sLastFrameTime = 0;
int sFpsFrameCount = 0;

void serialDump() {
    Serial.println();
    // Module
    Serial.printf("Name: %s\r\n", sApplicationName);
    if (haveTime) {
        Serial.print("Time: ");
        printLocalTime(true);
    }
    Serial.printf("Firmware: %s (base: %s)\r\n", sCompileTimestamp, sExampleVersion);
    float sketchPct = 100 * sketchSize / sketchSpace;
    Serial.printf("Sketch Size: %i (total: %i, %.1f%% used)\r\n", sketchSize, sketchSpace, sketchPct);
    Serial.printf("MD5: %s\r\n", sketchMD5.c_str());
    Serial.printf("ESP sdk: %s\r\n", ESP.getSdkVersion());
    if (otaEnabled) {
        if (strlen(otaPassword) != 0) {
            Serial.printf("OTA: Enabled, Password: %s\r\n", otaPassword);
        } else {
            Serial.printf("OTA: Enabled, No Password! (insecure)\r\n");
        }
    } else {
        Serial.printf("OTA: Disabled\r\n");
    }
    // Network
    if (sInAccesspointMode) {
        if (sCaptivePortalEnabled) {
            Serial.printf("WiFi Mode: AccessPoint with captive portal\r\n");
        } else {
            Serial.printf("WiFi Mode: AccessPoint\r\n");
        }
        Serial.printf("WiFi SSID: %s\r\n", apName);
    } else {
        Serial.printf("WiFi Mode: Client\r\n");
        String ssidName = WiFi.SSID();
        Serial.printf("WiFi Ssid: %s\r\n", ssidName.c_str());
        Serial.printf("WiFi Rssi: %i\r\n", WiFi.RSSI());
        String bssid = WiFi.BSSIDstr();
        Serial.printf("WiFi BSSID: %s\r\n", bssid.c_str());
    }
    Serial.printf("WiFi IP address: %d.%d.%d.%d\r\n", ip[0], ip[1], ip[2], ip[3]);
    if (!sInAccesspointMode) {
        Serial.printf("WiFi Netmask: %d.%d.%d.%d\r\n", net[0], net[1], net[2], net[3]);
        Serial.printf("WiFi Gateway: %d.%d.%d.%d\r\n", gw[0], gw[1], gw[2], gw[3]);
    }
    Serial.printf("WiFi Http port: %i, Stream port: %i\r\n", httpPort, streamPort);
    byte mac[6];
    WiFi.macAddress(mac);
    Serial.printf("WiFi MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    // System
    int64_t sec = esp_timer_get_time() / 1000000;
    int64_t upDays = int64_t(floor(sec / 86400));
    int upHours = int64_t(floor(sec / 3600)) % 24;
    int upMin = int64_t(floor(sec / 60)) % 60;
    int upSec = sec % 60;
    int McuTc = (temprature_sens_read() - 32) / 1.8; // celsius
    int McuTf = temprature_sens_read(); // fahrenheit
    Serial.printf("System up: %" PRId64 ":%02i:%02i:%02i (d:h:m:s)\r\n", upDays, upHours, upMin, upSec);
    Serial.printf("Active streams: %i, Previous streams: %lu, Images captured: %lu\r\n", streamCount, streamsServed, imagesServed);
    Serial.printf("Freq: %li MHz\r\n", ESP.getCpuFreqMHz());
    Serial.printf("MCU temperature : %i C, %i F  (approximate)\r\n", McuTc, McuTf);
    Serial.printf("Heap: %li, free: %li, min free: %li, max block: %li\r\n", ESP.getHeapSize(), ESP.getFreeHeap(),
            ESP.getMinFreeHeap(), ESP.getMaxAllocHeap());
    if (psramFound()) {
        Serial.printf("Psram: %li, free: %li, min free: %li, max block: %li\r\n", ESP.getPsramSize(), ESP.getFreePsram(),
                ESP.getMinFreePsram(), ESP.getMaxAllocPsram());
    } else {
        Serial.printf("Psram: Not found; please check your board configuration.\r\n");
        Serial.printf("- High resolution/quality settings will show incomplete frames to low memory.\r\n");
    }
    // Filesystems
    if (filesystem && (SPIFFS.totalBytes() > 0)) {
        Serial.printf("Spiffs: %i, used: %i\r\n", SPIFFS.totalBytes(), SPIFFS.usedBytes());
    } else {
        Serial.printf("Spiffs: No filesystem found, please check your board configuration.\r\n");
        Serial.printf("- Saving and restoring camera settings will not function without this.\r\n");
    }
    Serial.println("Preferences file: ");
    dumpPrefs(SPIFFS);
    if (critERR.length() > 0) {
        Serial.printf("\r\n\r\nA critical error has occurred when initialising Camera Hardware, see startup megssages\r\n");
    }
    Serial.println();
    return;
}

static esp_err_t capture_handler(httpd_req_t *req) {
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;

    sMillisOfLastAction = millis();
    Serial.println("Capture Requested");
    if (autoLampValue && (lampBrightnessPercentage != -1)) {
        setLamp(lampBrightnessPercentage);
    } else {
        flashLED(75); // little flash of status LED
    }

    int64_t fr_start = esp_timer_get_time();

    fb = esp_camera_fb_get();

