ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/app_httpd.cpp
    /*
     * Skip complete framebuffer
     */
    for (int i = 0; i < sNumberOfFramebuffer; ++i) {
        esp_camera_fb_return(fb); // dispose the buffered image
        fb = esp_camera_fb_get(); // get fresh image
    }

    if (!fb) {
        Serial.println("CAPTURE: failed to acquire frame");
        httpd_resp_send_500(req);
        if (autoLampValue && (lampBrightnessPercentage != -1)) {
            setLamp(0);
        }
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Content-Disposition", "inline");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    size_t fb_len = 0;
    if (fb->format == PIXFORMAT_JPEG) {
        fb_len = fb->len;
        res = httpd_resp_send(req, (const char*) fb->buf, fb->len);
    } else {
        res = ESP_FAIL;
        Serial.println("Capture Error: Non-JPEG image returned by camera module");
    }
    esp_camera_fb_return(fb);
    int64_t fr_end = esp_timer_get_time();
    if (debugData) {
        Serial.printf("JPG: %luB %lums\r\n", (uint32_t) (fb_len), (uint32_t) ((fr_end - fr_start) / 1000));
    }
    imagesServed++;
    if (autoLampValue && (lampBrightnessPercentage != -1))
        setLamp(0);
    return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char *part_buf[64];

    Serial.println("Stream requested");
    if (autoLampValue && (lampBrightnessPercentage != -1))
        setLamp(lampBrightnessPercentage);
    streamCount = 1; // at present we only have one stream handler, so values are 0 or 1..
    flashLED(75); // double flash of status LED
    delay(75);
    flashLED(75);

    static int64_t last_frame = 0;
    if (!last_frame) {
        last_frame = esp_timer_get_time();
    }

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK) {
        streamCount = 0;
        if (autoLampValue && (lampBrightnessPercentage != -1))
            setLamp(0);
        Serial.println("STREAM: failed to set HTTP response type");
        return res;
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    while (true) {
        fb = esp_camera_fb_get();
        if (!fb) {
            Serial.println("STREAM: failed to acquire frame");
            res = ESP_FAIL;
        } else {
            if (fb->format != PIXFORMAT_JPEG) {
                Serial.println("STREAM: Non-JPEG frame returned by camera module");
                res = ESP_FAIL;
            } else {
                sLastFrameTime = esp_timer_get_time();
                sFpsFrameCount++;
                _jpg_buf_len = fb->len;
                _jpg_buf = fb->buf;
            }
        }
        if (res == ESP_OK) {
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        if (res == ESP_OK) {
            size_t hlen = snprintf((char*) part_buf, 64, _STREAM_PART, _jpg_buf_len);
            res = httpd_resp_send_chunk(req, (const char*) part_buf, hlen);
        }
        if (res == ESP_OK) {
            res = httpd_resp_send_chunk(req, (const char*) _jpg_buf, _jpg_buf_len);
        }
        if (fb) {
            esp_camera_fb_return(fb); // release frame buffer
            fb = NULL;
            _jpg_buf = NULL;
        } else if (_jpg_buf) {
            free(_jpg_buf);
            _jpg_buf = NULL;
        }
        if (res != ESP_OK) {
            // This is the only exit point from the stream loop.
            // We end the stream here only if a Hard failure has been encountered or the connection has been interrupted.
            break;
        }
        int64_t frame_time = esp_timer_get_time() - last_frame;
        last_frame = esp_timer_get_time();

        frame_time /= 1000;
        if (debugData) {
            Serial.printf("MJPG: %luB %lums (%.1ffps)\r\n", (uint32_t) (_jpg_buf_len), (uint32_t) frame_time,
                    1000.0 / (uint32_t) frame_time);
        }
        sMillisOfLastAction = millis();
    }

    streamsServed++;
    streamCount = 0;
    if (autoLampValue && (lampBrightnessPercentage != -1))
        setLamp(0);
    Serial.println("Stream ended");
    last_frame = 0;
    return res;
}

/*
 * handles request to change a control value
 */
static esp_err_t cmd_handler(httpd_req_t *req) {
    char *buf;
    size_t buf_len;
    char tCommandString[32] = { 0, };
    char value[32] = { 0, };

    /*
     * Signal processing of a request
     */
    flashLED(75);
    sMillisOfLastAction = millis();

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char*) malloc(buf_len);
        if (!buf) {
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            if (httpd_query_key_value(buf, "var", tCommandString, sizeof(tCommandString)) == ESP_OK
                    && httpd_query_key_value(buf, "val", value, sizeof(value)) == ESP_OK) {
            } else {
                free(buf);
                httpd_resp_send_404(req);
                return ESP_FAIL;
            }
        } else {
            free(buf);
            httpd_resp_send_404(req);
            return ESP_FAIL;
        }
        free(buf);
    } else {
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }

    int val = atoi(value);
    sensor_t *s = esp_camera_sensor_get();
    int res = 0;
    if (!strcmp(tCommandString, "framesize")) {
        if (s->pixformat == PIXFORMAT_JPEG)
            res = s->set_framesize(s, (framesize_t) val);
    } else if (!strcmp(tCommandString, "quality"))
        res = s->set_quality(s, val);
    else if (!strcmp(tCommandString, "contrast"))
        res = s->set_contrast(s, val);
    else if (!strcmp(tCommandString, "brightness"))
        res = s->set_brightness(s, val);
    else if (!strcmp(tCommandString, "saturation"))
        res = s->set_saturation(s, val);
    else if (!strcmp(tCommandString, "gainceiling"))
        res = s->set_gainceiling(s, (gainceiling_t) val);
    else if (!strcmp(tCommandString, "colorbar"))
        res = s->set_colorbar(s, val);
    else if (!strcmp(tCommandString, "awb"))
        res = s->set_whitebal(s, val);
    else if (!strcmp(tCommandString, "agc"))
        res = s->set_gain_ctrl(s, val);
    else if (!strcmp(tCommandString, "aec"))
        res = s->set_exposure_ctrl(s, val);
    else if (!strcmp(tCommandString, "hmirror"))
        res = s->set_hmirror(s, val);
    else if (!strcmp(tCommandString, "vflip"))
        res = s->set_vflip(s, val);
    else if (!strcmp(tCommandString, "awb_gain"))
        res = s->set_awb_gain(s, val);
    else if (!strcmp(tCommandString, "agc_gain"))
        res = s->set_agc_gain(s, val);
    else if (!strcmp(tCommandString, "aec_value"))
        res = s->set_aec_value(s, val);
    else if (!strcmp(tCommandString, "aec2"))
        res = s->set_aec2(s, val);
    else if (!strcmp(tCommandString, "dcw"))
        res = s->set_dcw(s, val);
    else if (!strcmp(tCommandString, "bpc"))
        res = s->set_bpc(s, val);
    else if (!strcmp(tCommandString, "wpc"))
        res = s->set_wpc(s, val);
    else if (!strcmp(tCommandString, "raw_gma"))
        res = s->set_raw_gma(s, val);
    else if (!strcmp(tCommandString, "lenc"))
        res = s->set_lenc(s, val);
    else if (!strcmp(tCommandString, "special_effect"))
        res = s->set_special_effect(s, val);
    else if (!strcmp(tCommandString, "wb_mode"))
        res = s->set_wb_mode(s, val);
    else if (!strcmp(tCommandString, "ae_level"))
        res = s->set_ae_level(s, val);
    else if (!strcmp(tCommandString, "rotate"))
        myRotation = val;
    else if (!strcmp(tCommandString, "autolamp") && (lampBrightnessPercentage != -1)) {
        autoLampValue = val;
        if (autoLampValue) {
            if (streamCount > 0)
                setLamp(lampBrightnessPercentage);
            else
                setLamp(0);
        } else {
            setLamp(lampBrightnessPercentage);
        }
    } else if (!strcmp(tCommandString, "lamp") && (lampBrightnessPercentage != -1)) {
        lampBrightnessPercentage = constrain(val, 0, 100);
        if (autoLampValue) {
            if (streamCount > 0)
                setLamp(lampBrightnessPercentage);
            else
                setLamp(0);
        } else {
            setLamp(lampBrightnessPercentage);
        }
    } else if (!strcmp(tCommandString, "save_prefs")) {
        if (filesystem)
            savePrefs(SPIFFS);
    } else if (!strcmp(tCommandString, "clear_prefs")) {
        if (filesystem)
            removePrefs(SPIFFS);
    } else if (!strcmp(tCommandString, "reboot")) {
        // If the TWDT was not initialized automatically on startup, manually intialize it now
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        esp_task_wdt_config_t twdt_config = { .timeout_ms = 3000, .idle_core_mask = 0x03,    // Bitmask of all cores
                .trigger_panic = true, };
        esp_task_wdt_init(&twdt_config);  // schedule a a watchdog panic event for 3 seconds in the future
#else
        esp_task_wdt_init(3, true);  // schedule a a watchdog panic event for 3 seconds in the future
#endif

        esp_task_wdt_add(NULL);
        periph_module_disable(PERIPH_I2C0_MODULE);  // try to shut I2C down properly
        periph_module_disable(PERIPH_I2C1_MODULE);
        periph_module_reset(PERIPH_I2C0_MODULE);
        periph_module_reset(PERIPH_I2C1_MODULE);
        Serial.print("REBOOT requested");
        while (true) {
            flashLED(50);
            delay(150);
            Serial.print('.');
        }
    } else if (ServoAndMotorCommandInterpreter(tCommandString, val)) {
        // do nothing here;
    } else {
        res = -1;
        Serial.print("String=");
        Serial.print(tCommandString);
        Serial.print(" value=");
        Serial.println(val);
    }
    if (res) {
        return httpd_resp_send_500(req);
    }
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}

