ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/app_httpd.cpp
/*
 * request to send Application status to GUI
 */
static esp_err_t status_handler(httpd_req_t *req) {
    Serial.println("\r\nStatus requested via Web");
    Serial.print("LastMotorSpeed=");
    Serial.println(LastMotorSpeed);

    static char json_response[1024];
    sensor_t *s = esp_camera_sensor_get();
    char *p = json_response;
    *p++ = '{';
    if (lampBrightnessPercentage != -1) {
        p += sprintf(p, "\"lamp\":%d,", lampBrightnessPercentage);
        p += sprintf(p, "\"autolamp\":%d,", autoLampValue);
    }
    if (sPanServoIsSupported) {
        p += sprintf(p, "\"pan\":%d,", ServoPanDegree);
    }
    if (sOnePWMMotorIsSupported) {
        p += sprintf(p, "\"motor-speed\":%d,", LastMotorSpeed);
    }
    p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
    p += sprintf(p, "\"quality\":%u,", s->status.quality);
    p += sprintf(p, "\"brightness\":%d,", s->status.brightness);
    p += sprintf(p, "\"contrast\":%d,", s->status.contrast);
    p += sprintf(p, "\"saturation\":%d,", s->status.saturation);
    p += sprintf(p, "\"sharpness\":%d,", s->status.sharpness);
    p += sprintf(p, "\"special_effect\":%u,", s->status.special_effect);
    p += sprintf(p, "\"wb_mode\":%u,", s->status.wb_mode);
    p += sprintf(p, "\"awb\":%u,", s->status.awb);
    p += sprintf(p, "\"awb_gain\":%u,", s->status.awb_gain);
    p += sprintf(p, "\"aec\":%u,", s->status.aec);
    p += sprintf(p, "\"aec2\":%u,", s->status.aec2);
    p += sprintf(p, "\"ae_level\":%d,", s->status.ae_level);
    p += sprintf(p, "\"aec_value\":%u,", s->status.aec_value);
    p += sprintf(p, "\"agc\":%u,", s->status.agc);
    p += sprintf(p, "\"agc_gain\":%u,", s->status.agc_gain);
    p += sprintf(p, "\"gainceiling\":%u,", s->status.gainceiling);
    p += sprintf(p, "\"bpc\":%u,", s->status.bpc);
    p += sprintf(p, "\"wpc\":%u,", s->status.wpc);
    p += sprintf(p, "\"raw_gma\":%u,", s->status.raw_gma);
    p += sprintf(p, "\"lenc\":%u,", s->status.lenc);
    p += sprintf(p, "\"vflip\":%u,", s->status.vflip);
    p += sprintf(p, "\"hmirror\":%u,", s->status.hmirror);
    p += sprintf(p, "\"dcw\":%u,", s->status.dcw);
    p += sprintf(p, "\"colorbar\":%u,", s->status.colorbar);
    p += sprintf(p, "\"cam_name\":\"%s\",", sApplicationName);
    p += sprintf(p, "\"code_ver\":\"%s\",", sCompileTimestamp);
    p += sprintf(p, "\"rotate\":\"%d\",", myRotation);
    p += sprintf(p, "\"rssi\":\"%d\",", WiFi.RSSI());
    p += sprintf(p, "\"stream_url\":\"%s\"", streamURL);
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t fps_info_handler(httpd_req_t *req) {
    float tFPS = 0.0;
    Serial.print("FrameCount=");
    Serial.print(sFpsFrameCount);
    uint32_t tDeltaMillis = (sLastFrameTime - sFirstFrameTime) / 1000;
    if (sFpsFrameCount > 0) {
        tFPS = (1000.0 * sFpsFrameCount) / tDeltaMillis;
        // set for new measurement
        sFirstFrameTime = sLastFrameTime; // set time for first
        sFpsFrameCount = 0;
    }

    Serial.print(" FPS=");
    Serial.println(tFPS);

    static char json_response[64];
    char *p = json_response;
    *p++ = '{';
    p += sprintf(p, "\"fps\":\"%.1f\"", tFPS);
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t info_handler(httpd_req_t *req) {
    static char json_response[256];
    char *p = json_response;
    *p++ = '{';
    p += sprintf(p, "\"cam_name\":\"%s\",", sApplicationName);
    p += sprintf(p, "\"rotate\":\"%d\",", myRotation);
    p += sprintf(p, "\"stream_url\":\"%s\"", streamURL);
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t favicon_16x16_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "image/png");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) favicon_16x16_png, favicon_16x16_png_len);
}

static esp_err_t favicon_32x32_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "image/png");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) favicon_32x32_png, favicon_32x32_png_len);
}

static esp_err_t favicon_ico_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "image/x-icon");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) favicon_ico, favicon_ico_len);
}

static esp_err_t logo_svg_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "image/svg+xml");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) logo_svg, logo_svg_len);
}

static esp_err_t dump_handler(httpd_req_t *req) {
    flashLED(75);
    Serial.println("\r\nDump Requested via Web");
    serialDump();
    static char dumpOut[2000] = "";
    char *d = dumpOut;
// Header
    d += sprintf(d, "<html><head><meta charset=\"utf-8\">\n");
    d += sprintf(d, "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">\n");
    d += sprintf(d, "<title>%s - Status</title>\n", sApplicationName);
    d += sprintf(d, "<link rel=\"icon\" type=\"image/png\" sizes=\"32x32\" href=\"/favicon-32x32.png\">\n");
    d += sprintf(d, "<link rel=\"icon\" type=\"image/png\" sizes=\"16x16\" href=\"/favicon-16x16.png\">\n");
    d += sprintf(d, "<link rel=\"stylesheet\" type=\"text/css\" href=\"/style.css\">\n");
    d += sprintf(d, "</head>\n");
    d += sprintf(d, "<body>\n");
    d += sprintf(d, "<img src=\"/logo.svg\" style=\"position: relative; float: right;\">\n");
    if (critERR.length() > 0) {
        d += sprintf(d, "<span style=\"color:red;\">%s<hr></span>\n", critERR.c_str());
        d += sprintf(d, "<h2 style=\"color:red;\">(the serial log may give more information)</h2><br>\n");
    }
    d += sprintf(d, "<h1>ESP32 Cam Webserver</h1>\n");
// Module
    d += sprintf(d, "Name: %s<br>\n", sApplicationName);
    d += sprintf(d, "Firmware: %s (base: %s)<br>\n", sCompileTimestamp, sExampleVersion);
    float sketchPct = 100 * sketchSize / sketchSpace;
    d += sprintf(d, "Sketch Size: %i (total: %i, %.1f%% used)<br>\n", sketchSize, sketchSpace, sketchPct);
    d += sprintf(d, "MD5: %s<br>\n", sketchMD5.c_str());
    d += sprintf(d, "ESP sdk: %s<br>\n", ESP.getSdkVersion());
// Network
    d += sprintf(d, "<h2>WiFi</h2>\n");
    if (sInAccesspointMode) {
        if (sCaptivePortalEnabled) {
            d += sprintf(d, "Mode: AccessPoint with captive portal<br>\n");
        } else {
            d += sprintf(d, "Mode: AccessPoint<br>\n");
        }
        d += sprintf(d, "SSID: %s<br>\n", apName);
    } else {
        d += sprintf(d, "Mode: Client<br>\n");
        String ssidName = WiFi.SSID();
        d += sprintf(d, "SSID: %s<br>\n", ssidName.c_str());
        d += sprintf(d, "Rssi: %i<br>\n", WiFi.RSSI());
        String bssid = WiFi.BSSIDstr();
        d += sprintf(d, "BSSID: %s<br>\n", bssid.c_str());
    }
    d += sprintf(d, "IP address: %d.%d.%d.%d<br>\n", ip[0], ip[1], ip[2], ip[3]);
    if (!sInAccesspointMode) {
        d += sprintf(d, "Netmask: %d.%d.%d.%d<br>\n", net[0], net[1], net[2], net[3]);
        d += sprintf(d, "Gateway: %d.%d.%d.%d<br>\n", gw[0], gw[1], gw[2], gw[3]);
    }
    d += sprintf(d, "Http port: %i, Stream port: %i<br>\n", httpPort, streamPort);
    byte mac[6];
    WiFi.macAddress(mac);
    d += sprintf(d, "MAC: %02X:%02X:%02X:%02X:%02X:%02X<br>\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

