ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/app_httpd.cpp
// System
    d += sprintf(d, "<h2>System</h2>\n");
    if (haveTime) {
        struct tm timeinfo;
        if (getLocalTime(&timeinfo)) {
            char timeStringBuff[50]; //50 chars should be enough
            strftime(timeStringBuff, sizeof(timeStringBuff), "%H:%M:%S, %A, %B %d %Y", &timeinfo);
            //print like "const char*"
            d += sprintf(d, "Time: %s<br>\n", timeStringBuff);
        }
    }
    int64_t sec = esp_timer_get_time() / 1000000;
    int64_t upDays = int64_t(floor(sec / 86400));
    int upHours = int64_t(floor(sec / 3600)) % 24;
    int upMin = int64_t(floor(sec / 60)) % 60;
    int upSec = sec % 60;
    int McuTc = (temprature_sens_read() - 32) / 1.8; // celsius
    int McuTf = temprature_sens_read(); // fahrenheit

    d += sprintf(d, "Up: %" PRId64 ":%02i:%02i:%02i (d:h:m:s)<br>\n", upDays, upHours, upMin, upSec);
    d += sprintf(d, "Active streams: %i, Previous streams: %lu, Images captured: %lu<br>\n", streamCount, streamsServed,
            imagesServed);
    d += sprintf(d, "Freq: %li MHz<br>\n", ESP.getCpuFreqMHz());
    d +=
            sprintf(d,
                    "<span title=\"NOTE: Internal temperature sensor readings can be innacurate on the ESP32-c1 chipset, and may vary significantly between devices!\">");
    d += sprintf(d, "MCU temperature : %i &deg;C, %i &deg;F</span>\n<br>", McuTc, McuTf);
    d += sprintf(d, "Heap: %li, free: %li, min free: %li, max block: %li<br>\n", ESP.getHeapSize(), ESP.getFreeHeap(),
            ESP.getMinFreeHeap(), ESP.getMaxAllocHeap());
    if (psramFound()) {
        d += sprintf(d, "Psram: %li, free: %li, min free: %li, max block: %li<br>\n", ESP.getPsramSize(), ESP.getFreePsram(),
                ESP.getMinFreePsram(), ESP.getMaxAllocPsram());
    } else {
        d += sprintf(d, "Psram: <span style=\"color:red;\">Not found</span>, please check your board configuration.<br>\n");
        d += sprintf(d, "- High resolution/quality images & streams will show incomplete frames due to low memory.<br>\n");
    }
    if (filesystem && (SPIFFS.totalBytes() > 0)) {
        d += sprintf(d, "Spiffs: %i, used: %i<br>\n", SPIFFS.totalBytes(), SPIFFS.usedBytes());
    } else {
        d += sprintf(d,
                "Spiffs: <span style=\"color:red;\">No filesystem found</span>, please check your board configuration.<br>\n");
        d += sprintf(d, "- saving and restoring camera settings will not function without this.<br>\n");
    }

// Footer
    d += sprintf(d, "<br><div class=\"input-group\">\n");
    d +=
            sprintf(d,
                    "<button title=\"Instant Refresh; the page reloads every minute anyway\" onclick=\"location.replace(document.URL)\">Refresh</button>\n");
    d += sprintf(d, "<button title=\"Close this page\" onclick=\"javascript:window.close()\">Close</button>\n");
    d += sprintf(d, "</div>\n</body>\n");
// A javascript timer to refresh the page every minute.
    d += sprintf(d, "<script>\nsetTimeout(function(){\nlocation.replace(document.URL);\n}, 60000);\n");
    d += sprintf(d, "</script>\n</html>\n");
    *d++ = 0;
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, dumpOut, strlen(dumpOut));
}

static esp_err_t style_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "text/css");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) style_css, style_css_len);
}

static esp_err_t streamviewer_handler(httpd_req_t *req) {
    flashLED(75);
    Serial.println("Stream Viewer requested");
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) streamviewer_html, streamviewer_html_len);
}

static esp_err_t error_handler(httpd_req_t *req) {
    flashLED(75);
    Serial.println("Sending Error page");
    std::string s(error_html);
    size_t index;
    while ((index = s.find("<APPURL>")) != std::string::npos)
        s.replace(index, strlen("<APPURL>"), httpURL);
    while ((index = s.find("<CAMNAME>")) != std::string::npos)
        s.replace(index, strlen("<CAMNAME>"), sApplicationName);
    while ((index = s.find("<ERRORTEXT>")) != std::string::npos)
        s.replace(index, strlen("<ERRORTEXT>"), critERR.c_str());
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char*) s.c_str(), s.length());
}

static esp_err_t index_handler(httpd_req_t *req) {
    char *buf;
    size_t buf_len;
    char view[32] = { 0, };

    flashLED(75);
// See if we have a specific target (full/simple/portal) and serve as appropriate
    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char*) malloc(buf_len);
        if (!buf) {
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            if (httpd_query_key_value(buf, "view", view, sizeof(view)) == ESP_OK) {
            } else {
                free(buf);
                httpd_resp_send_404(req);
                return ESP_FAIL;
            }
        } else {
            free(buf);
            httpd_resp_send_404(req);
            return ESP_FAIL;
        }
        free(buf);
    } else {
        // no target specified; default.
        strcpy(view, default_index);
        // If captive portal is active send that instead
        if (sCaptivePortalEnabled) {
            strcpy(view, "portal");
        }
    }

    if (strncmp(view, "simple", sizeof(view)) == 0) {
        Serial.println("Simple index page requested");
        httpd_resp_set_type(req, "text/html");
        httpd_resp_set_hdr(req, "Content-Encoding", "identity");
        return httpd_resp_send(req, (const char*) index_simple_html, index_simple_html_len);
    } else if (strncmp(view, "full", sizeof(view)) == 0) {
        Serial.println("Full index page requested");
        httpd_resp_set_type(req, "text/html");
        httpd_resp_set_hdr(req, "Content-Encoding", "identity");
        sensor_t *s = esp_camera_sensor_get();
        if (s->id.PID == OV3660_PID) {
            return httpd_resp_send(req, (const char*) index_ov3660_html, index_ov3660_html_len);
        }
        return httpd_resp_send(req, (const char*) index_ov2640_html, index_ov2640_html_len);
    } else if (strncmp(view, "portal", sizeof(view)) == 0) {
        //Prototype captive portal landing page.
        Serial.println("Portal page requested");
        std::string s(portal_html);
        size_t index;
        while ((index = s.find("<APPURL>")) != std::string::npos)
            s.replace(index, strlen("<APPURL>"), httpURL);
        while ((index = s.find("<STREAMURL>")) != std::string::npos)
            s.replace(index, strlen("<STREAMURL>"), streamURL);
        while ((index = s.find("<CAMNAME>")) != std::string::npos)
            s.replace(index, strlen("<CAMNAME>"), sApplicationName);
        httpd_resp_set_type(req, "text/html");
        httpd_resp_set_hdr(req, "Content-Encoding", "identity");
        return httpd_resp_send(req, (const char*) s.c_str(), s.length());
    } else {
        Serial.print("Unknown page requested: ");
        Serial.println(view);
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
}

void startCameraServer(int hPort, int sPort) {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 12; // we use more than the default 8 (on port 80)

    httpd_uri_t index_uri = { .uri = "/", .method = HTTP_GET, .handler = index_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t status_uri = { .uri = "/status", .method = HTTP_GET, .handler = status_handler, .user_ctx = NULL, .is_websocket =
            false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t cmd_uri = { .uri = "/control", .method = HTTP_GET, .handler = cmd_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t capture_uri = { .uri = "/capture", .method = HTTP_GET, .handler = capture_handler, .user_ctx = NULL, .is_websocket =
            false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t style_uri = { .uri = "/style.css", .method = HTTP_GET, .handler = style_handler, .user_ctx = NULL, .is_websocket =
            false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t favicon_16x16_uri = { .uri = "/favicon-16x16.png", .method = HTTP_GET, .handler = favicon_16x16_handler, .user_ctx =
    NULL, .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t favicon_32x32_uri = { .uri = "/favicon-32x32.png", .method = HTTP_GET, .handler = favicon_32x32_handler, .user_ctx =
    NULL, .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t favicon_ico_uri = { .uri = "/favicon.ico", .method = HTTP_GET, .handler = favicon_ico_handler, .user_ctx = NULL,
            .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t logo_svg_uri = { .uri = "/logo.svg", .method = HTTP_GET, .handler = logo_svg_handler, .user_ctx = NULL,
            .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t dump_uri = { .uri = "/dump", .method = HTTP_GET, .handler = dump_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t stream_uri = { .uri = "/", .method = HTTP_GET, .handler = stream_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t streamviewer_uri = { .uri = "/view", .method = HTTP_GET, .handler = streamviewer_handler, .user_ctx = NULL,
            .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t fps_info_uri = { .uri = "/fps_info", .method = HTTP_GET, .handler = fps_info_handler, .user_ctx = NULL,
            .is_websocket = false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t info_uri = { .uri = "/info", .method = HTTP_GET, .handler = info_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t error_uri = { .uri = "/", .method = HTTP_GET, .handler = error_handler, .user_ctx = NULL, .is_websocket = false,
            .handle_ws_control_frames = false, .supported_subprotocol = NULL };
    httpd_uri_t viewerror_uri = { .uri = "/view", .method = HTTP_GET, .handler = error_handler, .user_ctx = NULL, .is_websocket =
            false, .handle_ws_control_frames = false, .supported_subprotocol = NULL };

// Request Handlers; config.max_uri_handlers (above) must be >= the number of handlers
    config.server_port = hPort;
    config.ctrl_port = hPort;
    Serial.printf("Starting web server on port: '%d'\r\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        if (critERR.length() > 0) {
            httpd_register_uri_handler(camera_httpd, &error_uri);
        } else {
            httpd_register_uri_handler(camera_httpd, &index_uri);
            httpd_register_uri_handler(camera_httpd, &cmd_uri);
            httpd_register_uri_handler(camera_httpd, &status_uri);
            httpd_register_uri_handler(camera_httpd, &fps_info_uri);
            httpd_register_uri_handler(camera_httpd, &capture_uri);
        }
        httpd_register_uri_handler(camera_httpd, &style_uri);
        httpd_register_uri_handler(camera_httpd, &favicon_16x16_uri);
        httpd_register_uri_handler(camera_httpd, &favicon_32x32_uri);
        httpd_register_uri_handler(camera_httpd, &favicon_ico_uri);
        httpd_register_uri_handler(camera_httpd, &logo_svg_uri);
        httpd_register_uri_handler(camera_httpd, &dump_uri);
    }

    config.server_port = sPort;
    config.ctrl_port = sPort;
    Serial.printf("Starting stream server on port: '%d'\r\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        if (critERR.length() > 0) {
            httpd_register_uri_handler(camera_httpd, &error_uri);
            httpd_register_uri_handler(camera_httpd, &viewerror_uri);
        } else {
            httpd_register_uri_handler(stream_httpd, &stream_uri);
            httpd_register_uri_handler(stream_httpd, &info_uri);
            httpd_register_uri_handler(stream_httpd, &streamviewer_uri);
        }
        httpd_register_uri_handler(stream_httpd, &favicon_16x16_uri);
        httpd_register_uri_handler(stream_httpd, &favicon_32x32_uri);
        httpd_register_uri_handler(stream_httpd, &favicon_ico_uri);
    }
}
